In [2]:
import numpy as np
import pandas as pd
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

# 1. Cách tạo ra data frame

In [3]:
data = np.random.rand(4, 5) * 20 + 10
row_index = ['A', 'B', 'C', 'D', 'E']
column_index = ['X', 'Y', 'Z', 'K']
data_frame = pd.DataFrame(data, column_index, row_index)
data_frame

           A          B          C          D          E
X  29.951515  21.199268  21.465605  10.199094  14.821767
Y  23.770316  26.336816  24.407821  12.936323  16.957254
Z  17.449501  20.867235  16.206519  28.282915  16.769797
K  22.972260  16.672776  27.953682  27.522114  29.246581

# 2. Lấy 1 cột, 1 hàng

In [4]:
data_frame['A']

X    29.951515
Y    23.770316
Z    17.449501
K    22.972260
Name: A, dtype: float64

In [5]:
data_frame.loc['Z']
data_frame.iloc[2]

A    17.449501
B    20.867235
C    16.206519
D    28.282915
E    16.769797
Name: Z, dtype: float64

A    17.449501
B    20.867235
C    16.206519
D    28.282915
E    16.769797
Name: Z, dtype: float64

# 3. Lấy nhiều cột, nhiều hàng liên tục

In [6]:
data_frame[['A', 'B']]

           A          B
X  29.951515  21.199268
Y  23.770316  26.336816
Z  17.449501  20.867235
K  22.972260  16.672776

In [7]:
data_frame.loc[['X', 'Z']]

           A          B          C          D          E
X  29.951515  21.199268  21.465605  10.199094  14.821767
Z  17.449501  20.867235  16.206519  28.282915  16.769797

# 4. Lấy 1 khối hàng, cột

In [8]:
data_frame.loc[['Y', 'Z'], ['C', 'D']]

           C          D
Y  24.407821  12.936323
Z  16.206519  28.282915

# 5. Tạo cột mới

In [9]:
data_frame['Sum'] = data_frame['A'] + data_frame['B']
data_frame

           A          B          C          D          E        Sum
X  29.951515  21.199268  21.465605  10.199094  14.821767  51.150782
Y  23.770316  26.336816  24.407821  12.936323  16.957254  50.107132
Z  17.449501  20.867235  16.206519  28.282915  16.769797  38.316736
K  22.972260  16.672776  27.953682  27.522114  29.246581  39.645036

# 6. Xoá cột/hàng

In [10]:
data_frame.drop('Sum', axis=1, inplace=True)
# axis: 1 là cột, 0 là hàng
# inplace: True là xoá luôn, False là xoá tạm thời
data_frame

           A          B          C          D          E
X  29.951515  21.199268  21.465605  10.199094  14.821767
Y  23.770316  26.336816  24.407821  12.936323  16.957254
Z  17.449501  20.867235  16.206519  28.282915  16.769797
K  22.972260  16.672776  27.953682  27.522114  29.246581

# 7. Điều kiện
## a. 1 điều kiện

In [11]:
data_frame[data_frame['C'] > 20]

           A          B          C          D          E
X  29.951515  21.199268  21.465605  10.199094  14.821767
Y  23.770316  26.336816  24.407821  12.936323  16.957254
K  22.972260  16.672776  27.953682  27.522114  29.246581

In [13]:
data_frame[data_frame['C'] > 20]['C']

X    21.465605
Y    24.407821
K    27.953682
Name: C, dtype: float64

In [14]:
data_frame[data_frame['C'] > 20][['C', 'D']]

           C          D
X  21.465605  10.199094
Y  24.407821  12.936323
K  27.953682  27.522114

## b. 2 điều kiện

In [15]:
data_frame[(data_frame['C'] > 20) & (data_frame['D'] > 15)]

          A          B          C          D          E
K  22.97226  16.672776  27.953682  27.522114  29.246581

In [16]:
data_frame[(data_frame['C'] > 20) & (data_frame['D'] > 15)][['C', 'D']]

           C          D
K  27.953682  27.522114

# 8. Reset index (row) name

In [17]:
data_frame.reset_index()

  index          A          B          C          D          E
0     X  29.951515  21.199268  21.465605  10.199094  14.821767
1     Y  23.770316  26.336816  24.407821  12.936323  16.957254
2     Z  17.449501  20.867235  16.206519  28.282915  16.769797
3     K  22.972260  16.672776  27.953682  27.522114  29.246581

In [20]:
data_frame['States'] = ['CA', 'NY', 'WY', 'OR']
data_frame

           A          B          C          D          E States
X  29.951515  21.199268  21.465605  10.199094  14.821767     CA
Y  23.770316  26.336816  24.407821  12.936323  16.957254     NY
Z  17.449501  20.867235  16.206519  28.282915  16.769797     WY
K  22.972260  16.672776  27.953682  27.522114  29.246581     OR

In [22]:
data_frame.set_index('States')

                A          B          C          D          E
States
CA      29.951515  21.199268  21.465605  10.199094  14.821767
NY      23.770316  26.336816  24.407821  12.936323  16.957254
WY      17.449501  20.867235  16.206519  28.282915  16.769797
OR      22.972260  16.672776  27.953682  27.522114  29.246581

In [23]:
data_frame.set_index('A')

                   B          C          D          E States
A
29.951515  21.199268  21.465605  10.199094  14.821767     CA
23.770316  26.336816  24.407821  12.936323  16.957254     NY
17.449501  20.867235  16.206519  28.282915  16.769797     WY
22.972260  16.672776  27.953682  27.522114  29.246581     OR